Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::RoutingNode::Modifier Class Reference
MEP Element Manager
Modifier of the RoutingNode. More...
#include <MEPRoutingNode.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingNode::Modifier:
 Public Member Functions
void  | SetPosition (const API_Coord3D &newPosition)
Sets a new position of the Routing Node.
void  | SetPreferredTransitionPlacement (PreferredTransitionPlacement preferredTransitionPlacement)
Sets the rule of the Elbow-Transition placement order of the Routing Node.
Result< void >  | Inject (const RoutingNodeDefault &routingNodeDefault)
Injects the given Default settings to the RoutingNode.
Result< void >  | SetTransitionDefaultParameters (const TransitionDefault &transitionDefault)
Sets the parameters of the Transitions.
Result< void >  | SetElbowDefaultParameters (const ElbowDefault &elbowDefault)
Sets the parameters of the Elbows.
 Protected Member Functions
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the RoutingNode.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::RoutingNode::Modifier::Inject  |  ( |  const RoutingNodeDefault & |  routingNodeDefault | )
Injects the given Default settings to the RoutingNode.
Parameters
routingNodeDefault | The Default which will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ SetElbowDefaultParameters()
 Result< void > ACAPI::MEP::RoutingNode::Modifier::SetElbowDefaultParameters  |  ( |  const ElbowDefault & |  elbowDefault | )
Sets the parameters of the Elbows.
Parameters
elbowDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.
◆ SetPosition()
 void ACAPI::MEP::RoutingNode::Modifier::SetPosition  |  ( |  const API_Coord3D & |  newPosition | )
Sets a new position of the Routing Node.
Parameters
newPosition | The new position of the Routing Node.
◆ SetPreferredTransitionPlacement()
 void ACAPI::MEP::RoutingNode::Modifier::SetPreferredTransitionPlacement  |  ( |  PreferredTransitionPlacement |  preferredTransitionPlacement | )
Sets the rule of the Elbow-Transition placement order of the Routing Node.
Parameters
preferredTransitionPlacement | The rule to be set.
◆ SetTransitionDefaultParameters()
 Result< void > ACAPI::MEP::RoutingNode::Modifier::SetTransitionDefaultParameters  |  ( |  const TransitionDefault & |  transitionDefault | )
Sets the parameters of the Transitions.
Parameters
transitionDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.